<template>
  <div class="address">
    <van-nav-bar
      fixed
      title="标题"
      left-text="返回"
      right-text="地址管理"
      left-arrow
      @click-left="onClickLeft"
      @click-right="onClickRight"
    />
    <van-address-edit
      :area-list="areaList"
      show-postal
      show-set-default
      :address-info="AddressInfo"
      show-search-result
      :search-result="searchResult"
      :area-columns-placeholder="['请选择', '请选择', '请选择']"
      @save="onSave"
      @delete="onDelete"
      @change-detail="onChangeDetail"
    />
  </div>
</template>

<style lang="scss">
.address {
  padding-top: 50px;
  .van-nav-bar {
    background-color: #14d6dd;
  }
}
</style>

<script>
export default {
  props:["aid"],
  data() {
    return {
      areaList: {
        province_list: {
          110000: "北京市",
          120000: "天津市",
          130000: "河北省",
          140000: "山西省",
          150000: "内蒙古自治区",
          210000: "辽宁省",
          220000: "吉林省",
          230000: "黑龙江省",
          310000: "上海市",
          320000: "江苏省",
          330000: "浙江省",
          340000: "安徽省",
          350000: "福建省",
          360000: "江西省",
          370000: "山东省",
          410000: "河南省",
          420000: "湖北省",
          430000: "湖南省",
          440000: "广东省",
          450000: "广西壮族自治区",
          460000: "海南省",
          500000: "重庆市",
          510000: "四川省",
          520000: "贵州省",
          530000: "云南省",
          540000: "西藏自治区",
          610000: "陕西省",
          620000: "甘肃省",
          630000: "青海省",
          640000: "宁夏回族自治区",
          650000: "新疆维吾尔自治区",
          710000: "台湾省",
          810000: "香港特别行政区",
          820000: "澳门特别行政区",
        },
        city_list: {
          110100: "北京市",
          120100: "天津市",
          130100: "石家庄市",
          130200: "唐山市",
          130300: "秦皇岛市",
          130400: "邯郸市",
          130500: "邢台市",
          130600: "保定市",
          130700: "张家口市",
          130800: "承德市",
          130900: "沧州市",
          131000: "廊坊市",
          131100: "衡水市",
        },
        county_list: {
          110101: "东城区",
          110102: "西城区",
          110105: "朝阳区",
          110106: "丰台区",
          110107: "石景山区",
          110108: "海定区",
          110113: "顺义区",
          110112: "通州区",
          110115: "大兴区",
          110111: "房山区",
          110109: "门头沟区",
          110114: "昌平区",
          110117: "平谷区",
          110118: "密云区",
          110116: "怀柔区",
          110119: "延庆区",

          120101: "和平区",
          120102: "河东区",
          120103: "河西区",
          120104: "南开区",
          120105: "河北区",
          120106: "红桥区",
          120116: "滨海新区",
          120110: "东丽区",
          120111: "西青区",
          120112: "津南区",
          120113: "北辰区",
          120114: "武清区",
          120115: "宝坻区",
          120121: "宁河区",
          120123: "静海区",

          130101: "石家庄市",
          130102: "长安区",
          130103: "桥东区",
          130104: "桥西区",
          130105: "新华区",
          130106: "郊区",
          130107: "井陉矿区",
          130121: "井陉县",
          130123: "正定县",
          130124: "栾城县",
          130125: "行唐县",
          130126: "灵寿县",
          130127: "高邑县",
          130128: "深泽县",
          130129: "赞皇县",
          130130: "无极县",
          130131: "平山县",
          130132: "元氏县",
          130133: "赵县",
          130181: "辛集市",
          130182: "藁城市",
          130183: "晋州市",
          130184: "新乐市",
          130185: "鹿泉市",

          130201: "唐山市",
          130202: "路南区",
          130203: "路北区",
          130204: "古冶区",
          130205: "开平区",
          130206: "新区",
          130221: "丰润县",
          130223: "滦县",
          130224: "滦南县",
          130225: "乐亭县",
          130227: "迁西县",
          130229: "玉田县",
          130230: "唐海县",
          130281: "遵化市",
          130282: "丰南市",
          130283: "迁安市",

          130301: "秦皇岛市",
          130302: "海港区",
          130303: "山海关区",
          130304: "北戴河区",
          130321: "青龙满族自治县",
          130322: "昌黎县",
          130323: "抚宁县",
          130324: "卢龙县",

          130401: "邯郸市",
          130402: "邯山区",
          130403: "丛台区",
          130404: "复兴区",
          130406: "峰峰矿区",
          130421: "邯郸县",
          130423: "临漳县",
          130424: "成安县",
          130425: "大名县",
          130426: "涉县",
          130427: "磁县",
          130428: "肥乡县",
          130429: "永年县",
          130430: "邱县",
          130431: "鸡泽县",
          130432: "广平县",
          130433: "馆陶县",
          130434: "魏县",
          130435: "曲周县",
          130481: "武安市",

          130501: "邢台市",
          130502: "桥东区",
          130503: "桥西区",
          130521: "邢台县",
          130522: "临城县",
          130523: "内丘县",
          130524: "柏乡县",
          130525: "隆尧县",
          130526: "任县",
          130527: "南和县",
          130528: "宁晋县",
          130529: "巨鹿县",
          130530: "新河县",
          130531: "广宗县",
          130532: "平乡县",
          130533: "威县",
          130534: "清河县",
          130535: "临西县",
          130581: "南宫市",
          130582: "沙河市",

          130601: "保定市",
          130602: "新市区",
          130603: "北市区",
          130604: "南市区",
          130621: "满城县",
          130622: "清苑县",
          130623: "涞水县",
          130624: "阜平县",
          130625: "徐水县",
          130626: "定兴县",
          130627: "唐县",
          130628: "高阳县",
          130629: "容城县",
          130630: "涞源县",
          130631: "望都县",
          130632: "安新县",
          130633: "易县",
          130634: "曲阳县",
          130635: "蠡县",
          130636: "顺平县",
          130637: "博野县",
          130638: "雄县",
          130681: "涿州市",
          130682: "定州市",
          130683: "安国市",
          130684: "高碑店市",

          130701: "张家口市",
          130702: "桥东区",
          130703: "桥西区",
          130705: "宣化区",
          130706: "下花园区",
          130721: "宣化县",
          130722: "张北县",
          130723: "康保县",
          130724: "沽源县",
          130725: "尚义县",
          130726: "蔚县",
          130727: "阳原县",
          130728: "怀安县",
          130729: "万全县",
          130730: "怀来县",
          130731: "涿鹿县",
          130732: "赤城县",
          130733: "崇礼县",

          130801: "承德市",
          130802: "双桥区",
          130803: "双滦区",
          130804: "鹰手营子矿区",
          130821: "承德县",
          130822: "兴隆县",
          130823: "平泉县",
          130824: "滦平县",
          130825: "隆化县",
          130826: "丰宁满族自治县",
          130827: "宽城满族自治县",
          130828: "围场满族蒙古族自治县",

          130901: "沧州市",
          130902: "新华区",
          130903: "运河区",
          130921: "沧县",
          130922: "青县",
          130923: "东光县",
          130924: "海兴县",
          130925: "盐山县",
          130926: "肃宁县",
          130927: "南皮县",
          130928: "吴桥县",
          130929: "献县",
          130930: "孟村回族自治县",
          130981: "泊头市",
          130982: "任丘市",
          130983: "黄骅市",
          130984: "河间市",

          131001: "廊坊市",
          131002: "安次区",
          131022: "固安县",
          131023: "永清县",
          131024: "香河县",
          131025: "大城县",
          131026: "文安县",
          131028: "大厂回族自治县",
          131081: "霸州市",
          131082: "三河市",

          131101: "衡水市",
          131102: "桃城区",
          131121: "枣强县",
          131122: "武邑县",
          131123: "武强县",
          131124: "饶阳县",
          131125: "安平县",
          131126: "故城县",
          131127: "景县",
          131128: "阜城县",
          131181: "冀州市",
          131182: "深州市",
        },
      },
      AddressInfo: {
        addressDetail: "",
        areaCode: '',
        city: "",
        county: "",
        name: "",
        postalCode: "",
        province: "",
        tel: "",
      },
      searchResult: [],
    };
  },
  mounted() {
    if (this.$store.state.islogin) {
      this.axios.get(`/adm/addedit`, { params: { aid:this.aid } })
        .then((result) => {
          this.AddressInfo.addressDetail=result.data[0].address;
          this.AddressInfo.areaCode=result.data[0].areaCode.toString();
          this.AddressInfo.city=result.data[0].city;
          this.AddressInfo.county=result.data[0].county;
          this.AddressInfo.name=result.data[0].aname;
          this.AddressInfo.postalCode=result.data[0].postalCode;
          this.AddressInfo.province=result.data[0].province;
          this.AddressInfo.tel=result.data[0].tel;
        }).catch((err) => {console.log(err);});
    }
  },
  methods: {
    onClickLeft() {
      this.$router.push(`/my`);
    },
    onClickRight() {
      this.$router.push(`/addlist`);
    },
    onSave(trc) {
      console.log(trc.isDefault?1:0);
      if (this.$store.state.islogin) {
      this.axios.post(`/adm/addset`, `aid=${this.aid}&uid=${this.$store.state.uid}&aname=${trc.name}&province=${trc.province}&city=${trc.city}&county=${trc.county}&address=${trc.addressDetail}&tel=${trc.tel}&postalCode=${trc.postalCode}&isDefault=${trc.isDefault?1:0}&areaCode=${trc.areaCode}`)
        .then((result) => {
          if (result.data.code===200) {
            this.$toast({message:result.data.msg,position:'bottom',duration:3000});
            setTimeout(()=>{this.$router.push('/addlist');},2000)
          }
        }).catch((err) => {console.log(err);});
    }else{
      this.$toast({message:'您还未请登录',position:'bottom',duration:3000});
    }
    },
    onDelete() {
      Toast("delete");
    },
    onChangeDetail(val) {
      // if (val) {this.searchResult = [
      //   {name: "黄龙万科中心",address: "杭州市西湖区",},
      //   ];} else {this.searchResult = [];}
    },
  },
};
</script>